Ran Plan for 5 projects:

1. dir: `apps-devstg/us-east-1/elasticache-redis` workspace: `default`
1. dir: `management/global/cost-report` workspace: `default`
1. dir: `management/global/organizations` workspace: `default`
1. dir: `management/global/sso` workspace: `default`
1. dir: `shared/us-east-1/secrets-manager` workspace: `default`
---

### 1. dir: `apps-devstg/us-east-1/elasticache-redis` workspace: `default`
<details><summary>Show Output</summary>

```diff
[15:50:38.889] INFO     Checking for local docker image, tag:                   
                        1.6.2-tofu-0.3.0-0-0...                                 
[15:50:38.900] INFO     ✔ OK                                                    
                                                                                
data.terraform_remote_state.vpc: Reading...
data.terraform_remote_state.shared_vpc: Reading...
data.aws_secretsmanager_secret_version.auth_token: Reading...
data.aws_secretsmanager_secret_version.auth_token: Read complete after 0s [id=/devops/apps-devstg/elasticache-redis/auth_token|AWSCURRENT]
data.terraform_remote_state.shared_vpc: Read complete after 0s
data.terraform_remote_state.vpc: Read complete after 0s

OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # module.elasticache_redis.aws_elasticache_parameter_group.default[0] will be created
  + resource "aws_elasticache_parameter_group" "default" {
      + arn         = (known after apply)
      + description = "Elasticache parameter group bb-apps-devstg-redis-redis7"
      + family      = "redis7"
      + id          = (known after apply)
      + name        = "bb-apps-devstg-redis-redis7"
      + tags        = {
          + "Name" = "bb-apps-devstg-redis"
        }
      + tags_all    = {
          + "Environment" = "apps-devstg"
          + "Layer"       = "elasticache-redis"
          + "Name"        = "bb-apps-devstg-redis"
          + "Terraform"   = "true"
        }

      + parameter {
          + name  = "notify-keyspace-events"
          + value = "lK"
        }
    }

  # module.elasticache_redis.aws_elasticache_replication_group.default[0] will be created
  + resource "aws_elasticache_replication_group" "default" {
      + apply_immediately              = true
      + arn                            = (known after apply)
      + at_rest_encryption_enabled     = "true"
      + auth_token                     = (sensitive value)
      + auth_token_update_strategy     = "SET"
      + auto_minor_version_upgrade     = (known after apply)
      + automatic_failover_enabled     = false
      + cluster_enabled                = (known after apply)
      + cluster_mode                   = (known after apply)
      + configuration_endpoint_address = (known after apply)
      + data_tiering_enabled           = false
      + description                    = "bb-apps-devstg-redis"
      + engine                         = "redis"
      + engine_version                 = "7.1"
      + engine_version_actual          = (known after apply)
      + global_replication_group_id    = (known after apply)
      + id                             = (known after apply)
      + ip_discovery                   = (known after apply)
      + maintenance_window             = "wed:03:00-wed:04:00"
      + member_clusters                = (known after apply)
      + multi_az_enabled               = false
      + network_type                   = "ipv4"
      + node_type                      = "cache.t3.small"
      + num_cache_clusters             = 1
      + num_node_groups                = (known after apply)
      + parameter_group_name           = "bb-apps-devstg-redis-redis7"
      + port                           = 6379
      + preferred_cache_cluster_azs    = [
          + "us-east-1a",
        ]
      + primary_endpoint_address       = (known after apply)
      + reader_endpoint_address        = (known after apply)
      + replicas_per_node_group        = (known after apply)
      + replication_group_id           = "bb-apps-devstg-redis"
      + security_group_ids             = (known after apply)
      + security_group_names           = (known after apply)
      + snapshot_retention_limit       = 0
      + snapshot_window                = "06:30-07:30"
      + subnet_group_name              = "bb-apps-devstg-redis"
      + tags                           = {
          + "Name" = "bb-apps-devstg-redis"
        }
      + tags_all                       = {
          + "Environment" = "apps-devstg"
          + "Layer"       = "elasticache-redis"
          + "Name"        = "bb-apps-devstg-redis"
          + "Terraform"   = "true"
        }
      + transit_encryption_enabled     = true
      + transit_encryption_mode        = (known after apply)
    }

  # module.elasticache_redis.aws_elasticache_subnet_group.default[0] will be created
  + resource "aws_elasticache_subnet_group" "default" {
      + arn         = (known after apply)
      + description = "Elasticache subnet group for bb-apps-devstg-redis"
      + id          = (known after apply)
      + name        = "bb-apps-devstg-redis"
      + subnet_ids  = [
          + "subnet-05d75d908f61d35e5",
          + "subnet-094c287defbc07180",
          + "subnet-0cec521de70ee76a3",
        ]
      + tags        = {
          + "Name" = "bb-apps-devstg-redis"
        }
      + tags_all    = {
          + "Environment" = "apps-devstg"
          + "Layer"       = "elasticache-redis"
          + "Name"        = "bb-apps-devstg-redis"
          + "Terraform"   = "true"
        }
      + vpc_id      = (known after apply)
    }

  # module.elasticache_redis.module.aws_security_group.aws_security_group.cbd[0] will be created
  + resource "aws_security_group" "cbd" {
      + arn                    = (known after apply)
      + description            = "Security group for Elasticache Redis"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "bb-apps-devstg-redis"
        }
      + tags_all               = {
          + "Environment" = "apps-devstg"
          + "Layer"       = "elasticache-redis"
          + "Name"        = "bb-apps-devstg-redis"
          + "Terraform"   = "true"
        }
      + vpc_id                 = "vpc-072f329fed6757e95"

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.elasticache_redis.module.aws_security_group.null_resource.sync_rules_and_sg_lifecycles[0] will be created
  + resource "null_resource" "sync_rules_and_sg_lifecycles" {
      + id       = (known after apply)
      + triggers = {
          + "sg_ids" = (known after apply)
        }
    }

  # module.elasticache_redis.module.aws_security_group.random_id.rule_change_forces_new_security_group[0] will be created
  + resource "random_id" "rule_change_forces_new_security_group" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 3
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "rules" = jsonencode({})
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + endpoint = (known after apply)
  + port     = 6379



Saved the plan to: default.tfplan

To perform exactly these actions, run the following command to apply:
    tofu apply "default.tfplan"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d apps-devstg/us-east-1/elasticache-redis
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.binbash.com.ar:4141/lock?id=binbashar%252Fle-tf-infra-aws%252Fapps-devstg%252Fus-east-1%252Felasticache-redis%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d apps-devstg/us-east-1/elasticache-redis
  ```
Plan: 6 to add, 0 to change, 0 to destroy.

---
### 2. dir: `management/global/cost-report` workspace: `default`
<details><summary>Show Output</summary>

```diff
[15:50:56.767] INFO     Checking for local docker image, tag:                   
                        1.6.2-tofu-0.3.0-0-0...                                 
[15:50:56.783] INFO     ✔ OK                                                    
                                                                                
module.cost_report.data.external.archive_prepare[0]: Reading...
module.cost_report.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.cost_report.local_file.archive_plan[0]: Refreshing state... [id=ce6c30b27e569cdb210c9f3962a65c7b3c63b4ea]
module.cost_report.null_resource.archive[0]: Refreshing state... [id=9092462144910318072]
module.cost_report.data.aws_partition.current: Reading...
module.cost_report.data.aws_iam_policy_document.assume_role[0]: Reading...
module.cost_report.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/bb-root-cost-report]
module.cost_report.data.aws_region.current: Reading...
module.cost_report.data.aws_caller_identity.current: Reading...
aws_cloudwatch_event_rule.lambda_schedule: Refreshing state... [id=bb-root-cost-report-helper-daily]
module.cost_report.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.cost_report.data.aws_partition.current: Read complete after 0s [id=aws]
module.cost_report.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.cost_report.aws_iam_role.lambda[0]: Refreshing state... [id=bb-root-cost-report]
module.cost_report.data.aws_caller_identity.current: Read complete after 0s [id=754065527950]
module.cost_report.data.aws_iam_policy_document.logs[0]: Reading...
module.cost_report.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=1316491389]
module.cost_report.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=bb-root-cost-report:bb-root-cost-report-0]
module.cost_report.aws_iam_role_policy.logs[0]: Refreshing state... [id=bb-root-cost-report:bb-root-cost-report-logs]
module.cost_report.aws_lambda_function.this[0]: Refreshing state... [id=bb-root-cost-report]
aws_cloudwatch_event_target.lambda_target: Refreshing state... [id=bb-root-cost-report-helper-daily-SendToLambda]
aws_lambda_permission.allow_eventbridge: Refreshing state... [id=AllowExecutionFromEventBridge]

No changes. Your infrastructure matches the configuration.

OpenTofu has compared your real infrastructure against your configuration and found no differences, so no changes are needed.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d management/global/cost-report
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.binbash.com.ar:4141/lock?id=binbashar%252Fle-tf-infra-aws%252Fmanagement%252Fglobal%252Fcost-report%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d management/global/cost-report
  ```
No changes. Your infrastructure matches the configuration.

---
### 3. dir: `management/global/organizations` workspace: `default`
<details><summary>Show Output</summary>

```diff
[15:51:15.409] INFO     Checking for local docker image, tag:                   
                        1.6.2-tofu-0.3.0-0-0...                                 
[15:51:15.422] INFO     ✔ OK                                                    
                                                                                
null_resource.ram_enable_sharing_with_aws_organization: Refreshing state... [id=6822314433140342934]
data.aws_iam_roles.apps-prd: Reading...
data.aws_iam_roles.apps-devstg: Reading...
data.aws_iam_roles.shared: Reading...
data.aws_iam_roles.apps-prd: Read complete after 0s [id=us-east-1]
data.aws_iam_roles.network: Reading...
data.aws_iam_roles.apps-devstg: Read complete after 0s [id=us-east-1]
data.aws_iam_roles.shared: Read complete after 0s [id=us-east-1]
data.aws_iam_roles.network: Read complete after 0s [id=us-east-1]
aws_organizations_policy.delete_protection: Refreshing state... [id=p-m6li7ssz]
aws_iam_service_linked_role.linked_roles["config.amazonaws.com"]: Refreshing state... [id=arn:aws:iam::754065527950:role/aws-service-role/config.amazonaws.com/AWSServiceRoleForConfig]
aws_organizations_policy.tag_protection: Refreshing state... [id=p-7nyj6n2n]
aws_iam_service_linked_role.linked_roles["access-analyzer.amazonaws.com"]: Refreshing state... [id=arn:aws:iam::754065527950:role/aws-service-role/access-analyzer.amazonaws.com/AWSServiceRoleForAccessAnalyzer]
aws_organizations_account.root: Refreshing state... [id=754065527950]
aws_organizations_organization.main: Refreshing state... [id=o-8mgimbu5mr]
aws_organizations_policy.default: Refreshing state... [id=p-up97og9o]
aws_organizations_policy.standard: Refreshing state... [id=p-b85e42hx]
aws_organizations_organizational_unit.units["bbl_data_science"]: Refreshing state... [id=ou-oz9d-a5euqznv]
aws_organizations_organizational_unit.units["bbl_workshop"]: Refreshing state... [id=ou-oz9d-2kap9n2s]
aws_organizations_organizational_unit.units["network"]: Refreshing state... [id=ou-oz9d-xyr6h0er]
aws_organizations_organizational_unit.units["security"]: Refreshing state... [id=ou-oz9d-0r3x4pz3]
aws_organizations_organizational_unit.units["shared"]: Refreshing state... [id=ou-oz9d-tbfuw3cz]
aws_organizations_organizational_unit.units["bbl_apps_devstg"]: Refreshing state... [id=ou-oz9d-yl3npduj]
aws_organizations_organizational_unit.units["bbl_apps_prd"]: Refreshing state... [id=ou-oz9d-78mid8ji]
aws_organizations_policy_attachment.tag_protection["shared"]: Refreshing state... [id=ou-oz9d-tbfuw3cz:p-7nyj6n2n]
aws_organizations_policy_attachment.tag_protection["bbl_apps_prd"]: Refreshing state... [id=ou-oz9d-78mid8ji:p-7nyj6n2n]
aws_organizations_policy_attachment.tag_protection["bbl_apps_devstg"]: Refreshing state... [id=ou-oz9d-yl3npduj:p-7nyj6n2n]
aws_organizations_account.accounts["apps-devstg"]: Refreshing state... [id=523857393444]
aws_organizations_policy_attachment.tag_protection["network"]: Refreshing state... [id=ou-oz9d-xyr6h0er:p-7nyj6n2n]
aws_organizations_policy_attachment.policy_attachments["network"]: Refreshing state... [id=ou-oz9d-xyr6h0er:p-up97og9o]
aws_organizations_policy_attachment.policy_attachments["security"]: Refreshing state... [id=ou-oz9d-0r3x4pz3:p-up97og9o]
aws_organizations_policy_attachment.policy_attachments["bbl_apps_prd"]: Refreshing state... [id=ou-oz9d-78mid8ji:p-b85e42hx]
aws_organizations_policy_attachment.policy_attachments["bbl_apps_devstg"]: Refreshing state... [id=ou-oz9d-yl3npduj:p-b85e42hx]
aws_organizations_policy_attachment.policy_attachments["shared"]: Refreshing state... [id=ou-oz9d-tbfuw3cz:p-b85e42hx]
aws_organizations_policy_attachment.policy_attachments["bbl_data_science"]: Refreshing state... [id=ou-oz9d-a5euqznv:p-b85e42hx]
aws_organizations_policy_attachment.policy_attachments["bbl_workshop"]: Refreshing state... [id=ou-oz9d-2kap9n2s:p-b85e42hx]
aws_organizations_account.accounts["workshop-genai-2"]: Refreshing state... [id=571170910595]
aws_organizations_account.accounts["apps-prd"]: Refreshing state... [id=802787198489]
aws_organizations_account.accounts["network"]: Refreshing state... [id=822280187662]
aws_organizations_account.accounts["data-science"]: Refreshing state... [id=905418344519]
aws_organizations_account.accounts["security"]: Refreshing state... [id=900980591242]
aws_organizations_account.accounts["shared"]: Refreshing state... [id=763606934258]
aws_organizations_account.accounts["workshop-genai-3"]: Refreshing state... [id=094271238832]
aws_organizations_account.accounts["workshop-genai-1"]: Refreshing state... [id=212088700810]
aws_organizations_policy_attachment.delete_protection["bbl_apps_devstg"]: Refreshing state... [id=ou-oz9d-yl3npduj:p-m6li7ssz]
aws_organizations_policy_attachment.delete_protection["bbl_apps_prd"]: Refreshing state... [id=ou-oz9d-78mid8ji:p-m6li7ssz]
aws_organizations_policy_attachment.delete_protection["network"]: Refreshing state... [id=ou-oz9d-xyr6h0er:p-m6li7ssz]
aws_organizations_policy_attachment.delete_protection["shared"]: Refreshing state... [id=ou-oz9d-tbfuw3cz:p-m6li7ssz]
aws_organizations_delegated_administrator.delegated_administrator["config.amazonaws.com"]: Refreshing state... [id=900980591242/config.amazonaws.com]
aws_organizations_delegated_administrator.delegated_administrator["access-analyzer.amazonaws.com"]: Refreshing state... [id=900980591242/access-analyzer.amazonaws.com]
aws_cloudtrail_organization_delegated_admin_account.main: Refreshing state... [id=900980591242]

No changes. Your infrastructure matches the configuration.

OpenTofu has compared your real infrastructure against your configuration and found no differences, so no changes are needed.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d management/global/organizations
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.binbash.com.ar:4141/lock?id=binbashar%252Fle-tf-infra-aws%252Fmanagement%252Fglobal%252Forganizations%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d management/global/organizations
  ```
No changes. Your infrastructure matches the configuration.

---
### 4. dir: `management/global/sso` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' 'leverage tf plan -input=false -refresh -out="$REAL_PLANFILE"' in '/root/.atlantis/repos/binbashar/le-tf-infra-aws/874/default/management/global/sso': exit status 1: running "leverage tf plan -input=false -refresh -out=\"$REAL_PLANFILE\"" in "/root/.atlantis/repos/binbashar/le-tf-infra-aws/874/default/management/global/sso": 
[15:51:39.780] INFO     Checking for local docker image, tag:                   
                        1.6.2-tofu-0.3.0-0-0...                                 
[15:51:39.793] INFO     ✔ OK                                                    
                                                                                
module.account_assignments.null_resource.dependency: Refreshing state... [id=3572017111657332447]
data.aws_iam_policy_document.data_scientist: Reading...
data.aws_iam_policy_document.marketplaceseller: Reading...
data.aws_ssoadmin_instances.main: Reading...
module.account_assignments.data.aws_ssoadmin_instances.this: Reading...
module.permission_sets.data.aws_ssoadmin_instances.this: Reading...
data.aws_iam_policy_document.github_automation: Reading...
data.aws_iam_policy_document.devops: Reading...
data.aws_iam_policy_document.marketplaceseller: Read complete after 0s [id=216798746]
data.aws_iam_policy_document.github_automation: Read complete after 0s [id=1914219528]
data.aws_iam_policy_document.data_scientist: Read complete after 0s [id=1102031294]
data.aws_iam_policy_document.devops: Read complete after 0s [id=3868196803]
data.aws_ssoadmin_instances.main: Read complete after 0s [id=us-east-1]
aws_ssoadmin_application.client_vpn[0]: Refreshing state... [id=arn:aws:sso::754065527950:application/ssoins-7223a8b7a94c4aaf/apl-94e8836cbb3f4074]
module.account_assignments.data.aws_ssoadmin_instances.this: Read complete after 0s [id=us-east-1]
module.permission_sets.data.aws_ssoadmin_instances.this: Read complete after 0s [id=us-east-1]
aws_identitystore_group.default["devops"]: Refreshing state... [id=d-906752b26f/64b8e4d8-2021-7077-f761-7e9cb2c9b7ea]
aws_identitystore_group.default["readonly"]: Refreshing state... [id=d-906752b26f/0448a468-4071-7006-7853-88485ab0c559]
aws_identitystore_group.default["marketplaceseller"]: Refreshing state... [id=d-906752b26f/84c89418-1041-7072-fde2-2021585e60cf]
aws_identitystore_group.default["finops"]: Refreshing state... [id=d-906752b26f/d4c854b8-f0c1-7038-9294-150077e02ac2]
aws_identitystore_group.default["securityauditor"]: Refreshing state... [id=d-906752b26f/24f82448-40a1-7080-7aed-4202ccd0a6d2]
aws_identitystore_user.default["carlos.paez"]: Refreshing state... [id=d-906752b26f/34f8b468-5041-7050-b38b-67f542d351bd]
aws_identitystore_group.default["administrators"]: Refreshing state... [id=d-906752b26f/7428b4d8-80c1-7029-ac73-9fce6c8ca9e1]
aws_identitystore_group.default["datascientists"]: Refreshing state... [id=d-906752b26f/64a89468-8051-70a4-c007-92ac6a2dba72]
aws_identitystore_user.default["marcos.acosta"]: Refreshing state... [id=d-906752b26f/b44824f8-c0d1-704b-113e-528302416d8b]
aws_identitystore_user.default["manuel.quinteros"]: Refreshing state... [id=d-906752b26f/3498d4a8-7031-70b9-d290-43649b45b74e]
aws_identitystore_user.default["roberto.trujillo"]: Refreshing state... [id=d-906752b26f/b4087438-c091-7061-509b-c9900263c3ae]
aws_identitystore_user.default["osvaldo.demo"]: Refreshing state... [id=d-906752b26f/04c84438-e0f1-7083-f98c-a2edcb153f68]
aws_identitystore_user.default["agustin.rodriguez"]: Refreshing state... [id=d-906752b26f/7408b448-80c1-702c-6669-94c56ff724c0]
aws_identitystore_user.default["dorian.machado"]: Refreshing state... [id=d-906752b26f/7448e458-e071-70c9-04b5-6eae0ed9e945]
aws_identitystore_user.default["federico.losso"]: Refreshing state... [id=d-906752b26f/e4485418-8011-70f3-dd97-1c729d9ed896]
aws_identitystore_user.default["francisco.rivera"]: Refreshing state... [id=d-906752b26f/d45894b8-a061-7011-ea0d-4fe4ad4dbbc5]
aws_identitystore_user.default["jose.peinado"]: Refreshing state... [id=d-906752b26f/54389428-f041-70b5-372f-23f939f7f0aa]
aws_identitystore_user.default["juan.delacamara"]: Refreshing state... [id=d-906752b26f/d4385418-a0d1-7085-3e56-04e109abec2d]
aws_identitystore_user.default["martin.galeano"]: Refreshing state... [id=d-906752b26f/44a8a408-e0c1-70cb-bdc4-e3569022baf3]
aws_identitystore_user.default["diego.ojeda"]: Refreshing state... [id=d-906752b26f/2488f448-b0d1-7009-587b-2ca9c2d4763b]
aws_identitystore_user.default["santiago.respane"]: Refreshing state... [id=d-906752b26f/b46834d8-b0f1-70d1-5344-e7493e0333ba]
aws_identitystore_user.default["matias.rodriguez"]: Refreshing state... [id=d-906752b26f/d4586478-60c1-705a-7571-4ce41d0de2f3]
aws_identitystore_user.default["lucas.coronel"]: Refreshing state... [id=d-906752b26f/1488d4b8-20b1-701d-cb60-cc4f4ad8431d]
aws_identitystore_user.default["rene.montilva"]: Refreshing state... [id=d-906752b26f/44d864b8-8081-7051-349e-8d687c065987]
aws_identitystore_user.default["favio.tolosa"]: Refreshing state... [id=d-906752b26f/148884b8-9031-709b-e859-628946b5e367]
aws_identitystore_user.default["exequiel.barrirero"]: Refreshing state... [id=d-906752b26f/34b86438-2001-70ad-08a4-d33044bc5ae5]
aws_identitystore_user.default["dario.villavicencio"]: Refreshing state... [id=d-906752b26f/3468d4f8-f001-704a-4cb5-3f9b59e1c9ef]
aws_identitystore_user.default["lucas.langwagen"]: Refreshing state... [id=d-906752b26f/34d86428-e021-7085-0d4b-f633ea5014f1]
aws_identitystore_user.default["alejandro.creta"]: Refreshing state... [id=d-906752b26f/8458a488-e0c1-70fe-45fd-1de6d4a08dee]
aws_identitystore_user.default["emiliano.brest"]: Refreshing state... [id=d-906752b26f/44f83448-00d1-7064-722e-0fb8723a43dd]
aws_identitystore_user.default["julian.curetti"]: Refreshing state... [id=d-906752b26f/44c8f4e8-80f1-7091-a200-0f9ddad2661d]
aws_identitystore_user.default["angelo.fenoglio"]: Refreshing state... [id=d-906752b26f/54a8c408-60b1-70a7-deab-875bc3613307]
aws_identitystore_user.default["diego.maye"]: Refreshing state... [id=d-906752b26f/5468c498-30c1-70fc-d1d4-59f8e72fb6e0]
aws_identitystore_user.default["nicolas.fressero"]: Refreshing state... [id=d-906752b26f/94087468-5021-70f8-1620-bfcfb9809a1e]
aws_identitystore_user.default["ezequiel.godoy"]: Refreshing state... [id=d-906752b26f/b46854d8-1071-702b-d8ce-7305cfdcc392]
aws_identitystore_user.default["marcelo.beresvil"]: Refreshing state... [id=d-906752b26f/14c8d4a8-d061-708d-7d50-f1be41fd7b81]
aws_identitystore_user.default["marcos.pagnucco"]: Refreshing state... [id=d-906752b26f/a4b86438-40d1-70ba-36ab-12541650074e]
aws_identitystore_user.default["luis.gallardo"]: Refreshing state... [id=d-906752b26f/f438d488-40b1-7062-bc8c-15c4768de0bd]
aws_identitystore_user.default["caetano.prates"]: Refreshing state... [id=d-906752b26f/349864e8-10a1-70f4-790b-a25ad02ed55b]
aws_identitystore_user.default["matias.sorozabal"]: Refreshing state... [id=d-906752b26f/94c894e8-5011-7098-c5e0-017fab5e3dfe]
aws_identitystore_user.default["ignacio.gomez"]: Refreshing state... [id=d-906752b26f/7448e478-b051-705a-7888-3aaec04b9217]
aws_identitystore_user.default["ariel.jalil"]: Refreshing state... [id=d-906752b26f/c488e488-a021-70ac-7015-d5418e0a6e24]
aws_identitystore_user.default["alex.delossantos"]: Refreshing state... [id=d-906752b26f/e4085468-40f1-70b4-1cd1-44736bc64afd]
aws_identitystore_user.default["juan.delatorre"]: Refreshing state... [id=d-906752b26f/c4f8b448-6041-707d-2320-a1d819495b56]
aws_identitystore_user.default["franco.gauchat"]: Refreshing state... [id=d-906752b26f/c41884c8-d031-7020-bfb0-fccac4eb12d1]
module.permission_sets.aws_ssoadmin_permission_set.this["Administrator"]: Refreshing state... [id=arn:aws:sso:::permissionSet/ssoins-7223a8b7a94c4aaf/ps-b966c51e27376a27,arn:aws:sso:::instance/ssoins-7223a8b7a94c4aaf]
module.permission_sets.aws_ssoadmin_permission_set.this["GithubAutomation"]: Refreshing state... [id=arn:aws:sso:::permissionSet/ssoins-7223a8b7a94c4aaf/ps-543b76e59abcde0b,arn:aws:sso:::instance/ssoins-7223a8b7a94c4aaf]
module.permission_sets.aws_ssoadmin_permission_set.this["DevOps"]: Refreshing state... [id=arn:aws:sso:::permissionSet/ssoins-7223a8b7a94c4aaf/ps-5ce391474f44a479,arn:aws:sso:::instance/ssoins-7223a8b7a94c4aaf]
module.permission_sets.aws_ssoadmin_permission_set.this["DataScientist"]: Refreshing state... [id=arn:aws:sso:::permissionSet/ssoins-7223a8b7a94c4aaf/ps-86478174e9a62b18,arn:aws:sso:::instance/ssoins-7223a8b7a94c4aaf]
module.permission_sets.aws_ssoadmin_permission_set.this["FinOps"]: Refreshing state... [id=arn:aws:sso:::permissionSet/ssoins-7223a8b7a94c4aaf/ps-2aa631f58807275a,arn:aws:sso:::instance/ssoins-7223a8b7a94c4aaf]
module.permission_sets.aws_ssoadmin_permission_set.this["ReadOnly"]: Refreshing state... [id=arn:aws:sso:::permissionSet/ssoins-7223a8b7a94c4aaf/ps-e435e2bb49065235,arn:aws:sso:::instance/ssoins-7223a8b7a94c4aaf]
module.permission_sets.aws_ssoadmin_permission_set.this["MarketplaceSeller"]: Refreshing state... [id=arn:aws:sso:::permissionSet/ssoins-7223a8b7a94c4aaf/ps-7db80e292219453d,arn:aws:sso:::instance/ssoins-7223a8b7a94c4aaf]
module.permission_sets.aws_ssoadmin_permission_set.this["SecurityAuditor"]: Refreshing state... [id=arn:aws:sso:::permissionSet/ssoins-7223a8b7a94c4aaf/ps-5ee005c164ced9c3,arn:aws:sso:::instance/ssoins-7223a8b7a94c4aaf]

Planning failed. OpenTofu encountered an error while generating this plan.

╷
│ Error: setting AWS SSO Admin Application ("arn:aws:sso::754065527950:application/ssoins-7223a8b7a94c4aaf/apl-94e8836cbb3f4074"): operation error SSO Admin: DescribeApplication, https response error StatusCode: 400, RequestID: 3bcb2667-82b1-47b2-9742-1dc69ce27d0f, AccessDeniedException: User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: sso:DescribeApplication on resource: arn:aws:sso::754065527950:application/ssoins-7223a8b7a94c4aaf/apl-94e8836cbb3f4074 because no identity-based policy allows the sso:DescribeApplication action
│ 
│   with aws_ssoadmin_application.client_vpn[0],
│   on client-vpn-application.tf line 1, in resource "aws_ssoadmin_application" "client_vpn":
│    1: resource "aws_ssoadmin_application" "client_vpn" {
│ 
│ operation error SSO Admin: DescribeApplication, https response error StatusCode: 400, RequestID: 3bcb2667-82b1-47b2-9742-1dc69ce27d0f, AccessDeniedException: User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: sso:DescribeApplication on resource: arn:aws:sso::754065527950:application/ssoins-7223a8b7a94c4aaf/apl-94e8836cbb3f4074 because no identity-based policy allows the sso:DescribeApplication action
╵
╷
│ Error: reading IdentityStore User (d-906752b26f/44c8f4e8-80f1-7091-a200-0f9ddad2661d): operation error identitystore: DescribeUser, https response error StatusCode: 400, RequestID: 4295c434-9479-48a7-ba31-6828e1064cb8, AccessDeniedException: User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore:::user/44c8f4e8-80f1-7091-a200-0f9ddad2661d because no identity-based policy allows the identitystore:DescribeUser action, User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore::754065527950:identitystore/d-906752b26f because no identity-based policy allows the identitystore:DescribeUser action
│ 
│   with aws_identitystore_user.default["julian.curetti"],
│   on users_groups.tf line 4, in resource "aws_identitystore_user" "default":
│    4: resource "aws_identitystore_user" "default" {
│ 
╵
╷
│ Error: reading IdentityStore User (d-906752b26f/e4085468-40f1-70b4-1cd1-44736bc64afd): operation error identitystore: DescribeUser, https response error StatusCode: 400, RequestID: 11e5ebd9-3664-45c1-b2c3-d154ca764803, AccessDeniedException: User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore::754065527950:identitystore/d-906752b26f because no identity-based policy allows the identitystore:DescribeUser action, User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore:::user/e4085468-40f1-70b4-1cd1-44736bc64afd because no identity-based policy allows the identitystore:DescribeUser action
│ 
│   with aws_identitystore_user.default["alex.delossantos"],
│   on users_groups.tf line 4, in resource "aws_identitystore_user" "default":
│    4: resource "aws_identitystore_user" "default" {
│ 
╵
╷
│ Error: reading IdentityStore User (d-906752b26f/b4087438-c091-7061-509b-c9900263c3ae): operation error identitystore: DescribeUser, https response error StatusCode: 400, RequestID: 3089f454-1ade-4901-9cd3-f78c324c5f8a, AccessDeniedException: User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore::754065527950:identitystore/d-906752b26f because no identity-based policy allows the identitystore:DescribeUser action, User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore:::user/b4087438-c091-7061-509b-c9900263c3ae because no identity-based policy allows the identitystore:DescribeUser action
│ 
│   with aws_identitystore_user.default["roberto.trujillo"],
│   on users_groups.tf line 4, in resource "aws_identitystore_user" "default":
│    4: resource "aws_identitystore_user" "default" {
│ 
╵
╷
│ Error: reading IdentityStore User (d-906752b26f/b46834d8-b0f1-70d1-5344-e7493e0333ba): operation error identitystore: DescribeUser, https response error StatusCode: 400, RequestID: a442518b-2aa9-4fa5-9da9-4a205c81abc9, AccessDeniedException: User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore:::user/b46834d8-b0f1-70d1-5344-e7493e0333ba because no identity-based policy allows the identitystore:DescribeUser action, User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore::754065527950:identitystore/d-906752b26f because no identity-based policy allows the identitystore:DescribeUser action
│ 
│   with aws_identitystore_user.default["santiago.respane"],
│   on users_groups.tf line 4, in resource "aws_identitystore_user" "default":
│    4: resource "aws_identitystore_user" "default" {
│ 
╵
╷
│ Error: reading IdentityStore User (d-906752b26f/44f83448-00d1-7064-722e-0fb8723a43dd): operation error identitystore: DescribeUser, https response error StatusCode: 400, RequestID: e84c5535-0682-4c82-893c-d00879a37d93, AccessDeniedException: User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore:::user/44f83448-00d1-7064-722e-0fb8723a43dd because no identity-based policy allows the identitystore:DescribeUser action, User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore::754065527950:identitystore/d-906752b26f because no identity-based policy allows the identitystore:DescribeUser action
│ 
│   with aws_identitystore_user.default["emiliano.brest"],
│   on users_groups.tf line 4, in resource "aws_identitystore_user" "default":
│    4: resource "aws_identitystore_user" "default" {
│ 
╵
╷
│ Error: reading IdentityStore User (d-906752b26f/148884b8-9031-709b-e859-628946b5e367): operation error identitystore: DescribeUser, https response error StatusCode: 400, RequestID: 2f6bbad5-dafd-410f-bcaf-b378116f1730, AccessDeniedException: User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore:::user/148884b8-9031-709b-e859-628946b5e367 because no identity-based policy allows the identitystore:DescribeUser action, User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore::754065527950:identitystore/d-906752b26f because no identity-based policy allows the identitystore:DescribeUser action
│ 
│   with aws_identitystore_user.default["favio.tolosa"],
│   on users_groups.tf line 4, in resource "aws_identitystore_user" "default":
│    4: resource "aws_identitystore_user" "default" {
│ 
╵
╷
│ Error: reading IdentityStore User (d-906752b26f/5468c498-30c1-70fc-d1d4-59f8e72fb6e0): operation error identitystore: DescribeUser, https response error StatusCode: 400, RequestID: e5d05627-f4b7-49e7-8aeb-a9266ac7b6a3, AccessDeniedException: User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore::754065527950:identitystore/d-906752b26f because no identity-based policy allows the identitystore:DescribeUser action, User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore:::user/5468c498-30c1-70fc-d1d4-59f8e72fb6e0 because no identity-based policy allows the identitystore:DescribeUser action
│ 
│   with aws_identitystore_user.default["diego.maye"],
│   on users_groups.tf line 4, in resource "aws_identitystore_user" "default":
│    4: resource "aws_identitystore_user" "default" {
│ 
╵
╷
│ Error: reading IdentityStore User (d-906752b26f/3468d4f8-f001-704a-4cb5-3f9b59e1c9ef): operation error identitystore: DescribeUser, https response error StatusCode: 400, RequestID: f686061c-bcaa-4403-b6af-5251de940a6c, AccessDeniedException: User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore:::user/3468d4f8-f001-704a-4cb5-3f9b59e1c9ef because no identity-based policy allows the identitystore:DescribeUser action, User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore::754065527950:identitystore/d-906752b26f because no identity-based policy allows the identitystore:DescribeUser action
│ 
│   with aws_identitystore_user.default["dario.villavicencio"],
│   on users_groups.tf line 4, in resource "aws_identitystore_user" "default":
│    4: resource "aws_identitystore_user" "default" {
│ 
╵
╷
│ Error: reading IdentityStore User (d-906752b26f/14c8d4a8-d061-708d-7d50-f1be41fd7b81): operation error identitystore: DescribeUser, https response error StatusCode: 400, RequestID: 7c5e2db7-bfe3-4037-919b-aa387b3ead51, AccessDeniedException: User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore::754065527950:identitystore/d-906752b26f because no identity-based policy allows the identitystore:DescribeUser action, User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore:::user/14c8d4a8-d061-708d-7d50-f1be41fd7b81 because no identity-based policy allows the identitystore:DescribeUser action
│ 
│   with aws_identitystore_user.default["marcelo.beresvil"],
│   on users_groups.tf line 4, in resource "aws_identitystore_user" "default":
│    4: resource "aws_identitystore_user" "default" {
│ 
╵
╷
│ Error: reading IdentityStore User (d-906752b26f/c4f8b448-6041-707d-2320-a1d819495b56): operation error identitystore: DescribeUser, https response error StatusCode: 400, RequestID: c2459806-babb-412a-869f-b034a86fc36c, AccessDeniedException: User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore::754065527950:identitystore/d-906752b26f because no identity-based policy allows the identitystore:DescribeUser action, User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore:::user/c4f8b448-6041-707d-2320-a1d819495b56 because no identity-based policy allows the identitystore:DescribeUser action
│ 
│   with aws_identitystore_user.default["juan.delatorre"],
│   on users_groups.tf line 4, in resource "aws_identitystore_user" "default":
│    4: resource "aws_identitystore_user" "default" {
│ 
╵
╷
│ Error: reading IdentityStore User (d-906752b26f/3498d4a8-7031-70b9-d290-43649b45b74e): operation error identitystore: DescribeUser, https response error StatusCode: 400, RequestID: dbedd542-adb0-4c4d-beb7-cf8562a80d4a, AccessDeniedException: User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore:::user/3498d4a8-7031-70b9-d290-43649b45b74e because no identity-based policy allows the identitystore:DescribeUser action, User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore::754065527950:identitystore/d-906752b26f because no identity-based policy allows the identitystore:DescribeUser action
│ 
│   with aws_identitystore_user.default["manuel.quinteros"],
│   on users_groups.tf line 4, in resource "aws_identitystore_user" "default":
│    4: resource "aws_identitystore_user" "default" {
│ 
╵
╷
│ Error: reading IdentityStore User (d-906752b26f/d4385418-a0d1-7085-3e56-04e109abec2d): operation error identitystore: DescribeUser, https response error StatusCode: 400, RequestID: 7184524a-e27f-431b-9e22-bf8d44bd855d, AccessDeniedException: User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore::754065527950:identitystore/d-906752b26f because no identity-based policy allows the identitystore:DescribeUser action, User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore:::user/d4385418-a0d1-7085-3e56-04e109abec2d because no identity-based policy allows the identitystore:DescribeUser action
│ 
│   with aws_identitystore_user.default["juan.delacamara"],
│   on users_groups.tf line 4, in resource "aws_identitystore_user" "default":
│    4: resource "aws_identitystore_user" "default" {
│ 
╵
╷
│ Error: reading IdentityStore User (d-906752b26f/44a8a408-e0c1-70cb-bdc4-e3569022baf3): operation error identitystore: DescribeUser, https response error StatusCode: 400, RequestID: 265a6dec-eeb1-4a25-9fe4-9dcad9346d0e, AccessDeniedException: User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore::754065527950:identitystore/d-906752b26f because no identity-based policy allows the identitystore:DescribeUser action, User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore:::user/44a8a408-e0c1-70cb-bdc4-e3569022baf3 because no identity-based policy allows the identitystore:DescribeUser action
│ 
│   with aws_identitystore_user.default["martin.galeano"],
│   on users_groups.tf line 4, in resource "aws_identitystore_user" "default":
│    4: resource "aws_identitystore_user" "default" {
│ 
╵
╷
│ Error: reading IdentityStore User (d-906752b26f/c488e488-a021-70ac-7015-d5418e0a6e24): operation error identitystore: DescribeUser, https response error StatusCode: 400, RequestID: 784d6eca-9959-4b46-95a9-bc951f795728, AccessDeniedException: User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore::754065527950:identitystore/d-906752b26f because no identity-based policy allows the identitystore:DescribeUser action, User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore:::user/c488e488-a021-70ac-7015-d5418e0a6e24 because no identity-based policy allows the identitystore:DescribeUser action
│ 
│   with aws_identitystore_user.default["ariel.jalil"],
│   on users_groups.tf line 4, in resource "aws_identitystore_user" "default":
│    4: resource "aws_identitystore_user" "default" {
│ 
╵
╷
│ Error: reading IdentityStore User (d-906752b26f/f438d488-40b1-7062-bc8c-15c4768de0bd): operation error identitystore: DescribeUser, https response error StatusCode: 400, RequestID: 602b3cde-9a22-4a74-b29c-aa49a530c256, AccessDeniedException: User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore::754065527950:identitystore/d-906752b26f because no identity-based policy allows the identitystore:DescribeUser action, User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore:::user/f438d488-40b1-7062-bc8c-15c4768de0bd because no identity-based policy allows the identitystore:DescribeUser action
│ 
│   with aws_identitystore_user.default["luis.gallardo"],
│   on users_groups.tf line 4, in resource "aws_identitystore_user" "default":
│    4: resource "aws_identitystore_user" "default" {
│ 
╵
╷
│ Error: reading IdentityStore User (d-906752b26f/c41884c8-d031-7020-bfb0-fccac4eb12d1): operation error identitystore: DescribeUser, https response error StatusCode: 400, RequestID: 88bb6ecc-7fc0-475e-90f0-a819c72f3d2b, AccessDeniedException: User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore::754065527950:identitystore/d-906752b26f because no identity-based policy allows the identitystore:DescribeUser action, User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore:::user/c41884c8-d031-7020-bfb0-fccac4eb12d1 because no identity-based policy allows the identitystore:DescribeUser action
│ 
│   with aws_identitystore_user.default["franco.gauchat"],
│   on users_groups.tf line 4, in resource "aws_identitystore_user" "default":
│    4: resource "aws_identitystore_user" "default" {
│ 
╵
╷
│ Error: reading IdentityStore User (d-906752b26f/e4485418-8011-70f3-dd97-1c729d9ed896): operation error identitystore: DescribeUser, https response error StatusCode: 400, RequestID: 1516bb4a-a16b-42ec-a5e8-71c36d1cb1d5, AccessDeniedException: User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore::754065527950:identitystore/d-906752b26f because no identity-based policy allows the identitystore:DescribeUser action, User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore:::user/e4485418-8011-70f3-dd97-1c729d9ed896 because no identity-based policy allows the identitystore:DescribeUser action
│ 
│   with aws_identitystore_user.default["federico.losso"],
│   on users_groups.tf line 4, in resource "aws_identitystore_user" "default":
│    4: resource "aws_identitystore_user" "default" {
│ 
╵
╷
│ Error: reading IdentityStore User (d-906752b26f/a4b86438-40d1-70ba-36ab-12541650074e): operation error identitystore: DescribeUser, https response error StatusCode: 400, RequestID: ad969886-6156-468d-90a0-0ce05f378d20, AccessDeniedException: User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore:::user/a4b86438-40d1-70ba-36ab-12541650074e because no identity-based policy allows the identitystore:DescribeUser action, User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore::754065527950:identitystore/d-906752b26f because no identity-based policy allows the identitystore:DescribeUser action
│ 
│   with aws_identitystore_user.default["marcos.pagnucco"],
│   on users_groups.tf line 4, in resource "aws_identitystore_user" "default":
│    4: resource "aws_identitystore_user" "default" {
│ 
╵
╷
│ Error: reading IdentityStore User (d-906752b26f/b46854d8-1071-702b-d8ce-7305cfdcc392): operation error identitystore: DescribeUser, https response error StatusCode: 400, RequestID: a3bacd7b-e9c1-4632-b3e7-ca58b475763d, AccessDeniedException: User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore:::user/b46854d8-1071-702b-d8ce-7305cfdcc392 because no identity-based policy allows the identitystore:DescribeUser action, User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore::754065527950:identitystore/d-906752b26f because no identity-based policy allows the identitystore:DescribeUser action
│ 
│   with aws_identitystore_user.default["ezequiel.godoy"],
│   on users_groups.tf line 4, in resource "aws_identitystore_user" "default":
│    4: resource "aws_identitystore_user" "default" {
│ 
╵
╷
│ Error: reading IdentityStore User (d-906752b26f/b44824f8-c0d1-704b-113e-528302416d8b): operation error identitystore: DescribeUser, https response error StatusCode: 400, RequestID: f7818c7d-fa61-4bc8-bfd7-703fe7a801d7, AccessDeniedException: User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore:::user/b44824f8-c0d1-704b-113e-528302416d8b because no identity-based policy allows the identitystore:DescribeUser action, User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore::754065527950:identitystore/d-906752b26f because no identity-based policy allows the identitystore:DescribeUser action
│ 
│   with aws_identitystore_user.default["marcos.acosta"],
│   on users_groups.tf line 4, in resource "aws_identitystore_user" "default":
│    4: resource "aws_identitystore_user" "default" {
│ 
╵
╷
│ Error: reading IdentityStore User (d-906752b26f/7408b448-80c1-702c-6669-94c56ff724c0): operation error identitystore: DescribeUser, https response error StatusCode: 400, RequestID: 8c5c82e2-f690-4c1b-81ef-5bfc9c73b8a6, AccessDeniedException: User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore::754065527950:identitystore/d-906752b26f because no identity-based policy allows the identitystore:DescribeUser action, User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore:::user/7408b448-80c1-702c-6669-94c56ff724c0 because no identity-based policy allows the identitystore:DescribeUser action
│ 
│   with aws_identitystore_user.default["agustin.rodriguez"],
│   on users_groups.tf line 4, in resource "aws_identitystore_user" "default":
│    4: resource "aws_identitystore_user" "default" {
│ 
╵
╷
│ Error: reading IdentityStore User (d-906752b26f/2488f448-b0d1-7009-587b-2ca9c2d4763b): operation error identitystore: DescribeUser, https response error StatusCode: 400, RequestID: 3bb10b29-7cd3-4861-a9e1-4ed7b3e443bc, AccessDeniedException: User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore::754065527950:identitystore/d-906752b26f because no identity-based policy allows the identitystore:DescribeUser action, User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore:::user/2488f448-b0d1-7009-587b-2ca9c2d4763b because no identity-based policy allows the identitystore:DescribeUser action
│ 
│   with aws_identitystore_user.default["diego.ojeda"],
│   on users_groups.tf line 4, in resource "aws_identitystore_user" "default":
│    4: resource "aws_identitystore_user" "default" {
│ 
╵
╷
│ Error: reading IdentityStore User (d-906752b26f/34b86438-2001-70ad-08a4-d33044bc5ae5): operation error identitystore: DescribeUser, https response error StatusCode: 400, RequestID: c035497e-70f6-4054-95e6-7fbdca0ed111, AccessDeniedException: User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:DescribeUser on resource: arn:aws:identitystore::754065527950:identitystore/d-906752b26f because no identity-based policy allows the identitystore:DescribeUser action, User: arn:aws:sts::754065527950:assumed-role/Atlantis/aws-go-sdk-1754668305846834563 is not authorized to perform: identitystore:Descr
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.